# Ініціалізуємо порожній список для збереження елементів послідовності
sequence = []
# Зчитуємо числа з введення користувача до тих пір, поки не введено 0
while True:
        num = int(input("Введіть число (0 для завершення): "))
        # Перевіряємо, чи користувач ввів 0 для завершення
        if num == 0:
            break
        # Додаємо число до списку
        sequence.append(num)
# Перевіряємо, чи послідовність не порожня
if sequence:
    max_number = max(sequence)
    print(f"Найбільше число в послідовності: {max_number}")
else:
    print("Послідовність порожня.")
