def is_palindrome(number):
    # Перевірка, чи є число  паліндромом
    return str(number) == str(number)[::-1]

# Введення двох чотирицифрових чисел a і b
a = int(input("Введіть перше чотирицифрове число (a): "))
b = int(input("Введіть друге чотирицифрове число (b): "))

# Перевірка, чи a і b є чотирицифровими числами
if 1000 <= a <= 9999 and 1000 <= b <= 9999:
    # Виведення чотирицифрових паліндромів від a до b
    for num in range(a, b + 1):
        if is_palindrome(num):
            print(num)
else:
    print("Будь ласка, введіть чотирицифрові числа.")